genestealer/everblu-meters-esp8266-improved/src/main.cpp
// Flag to indicate if current data read is from scheduled trigger (vs manual MQTT command)
// Used to control whether auto-alignment should be applied to future scheduled reads
static bool g_isScheduledRead = false;

// Day-of-year (tm_yday) of the last scheduled read, or -1 if none yet. Guards the
// scheduled read to once per day across the whole scheduled minute (see onScheduled).
// onScheduled() is re-armed on every reconnect, so several poll chains can run at
// once; this latch keeps them collectively to a single read per occurrence.
static int g_lastScheduledReadYday = -1;

// Define a default meter frequency if missing from private.h.
// RADIAN protocol nominal center frequency for EverBlu is 433.82 MHz.
#ifndef FREQUENCY
#define FREQUENCY 433.82
#define FREQUENCY_DEFINED_DEFAULT 1
#else
#define FREQUENCY_DEFINED_DEFAULT 0
#endif

unsigned long lastWifiUpdate = 0;

// Read success/failure metrics
unsigned long totalReadAttempts = 0;
unsigned long successfulReads = 0;
unsigned long failedReads = 0;
const char *lastErrorMessage = "None";

// CC1101 radio connection state
bool cc1101RadioConnected = false; // Tracks whether the radio is detected and initialized

// Frequency offset storage. The EEPROM/Preferences layout and all scan/adaptive
// state now live in the shared FrequencyManager (src/services/frequency_manager.cpp),
// which this build initializes in setup(). EEPROM_SIZE is retained only for the
// optional CLEAR_EEPROM_ON_BOOT maintenance path below.
#define EEPROM_SIZE 64
bool autoScanEnabled = (AUTO_SCAN_ENABLED != 0);                     // Enable automatic scan on first boot if no offset found
bool autoScanOnFailureEnabled = (AUTO_SCAN_ON_FAILURE_ENABLED != 0); // Enable automatic scan after max retries reached

// Define the adaptive frequency tracking threshold if missing from private.h
// Controls how many successful reads trigger a frequency adjustment
// Default: 1 (adjust after every read, ideal for once-per-day schedules)
// Increase to 5-10 for more stable reading conditions
#ifndef ADAPTIVE_THRESHOLD
#define ADAPTIVE_THRESHOLD 1
#endif
const int ADAPT_THRESHOLD = ADAPTIVE_THRESHOLD;

// Front-end RX attenuation, reported by the diagnostic report. The driver applies its own
// default when this is absent from private.h; mirror it so the report agrees with the radio.
#ifndef RX_ATTENUATION_DB
#define RX_ATTENUATION_DB 0
#endif

// Size of the retained JSON payload carrying the diagnostic report. The report itself is
// capped at CC1101_REPORT_BUFFER_SIZE; the headroom covers the JSON wrapper and the escaped
// newline after each of its ~17 lines. Must stay within the MQTT max packet size set below.
#define DIAGNOSTIC_REPORT_PAYLOAD_SIZE (CC1101_REPORT_BUFFER_SIZE + 256)

// ============================================================================
// Frequency Management API (thin MQTT wrappers over the shared FrequencyManager)
// ============================================================================

/**
 * @brief Perform a Deep frequency scan
 *
 * Starts staged acquisition and refinement around the configured frequency.
 * Also used on first boot when no stored offset exists.
 *
 * Saves discovered offset to persistent storage on success.
 */
void performDeepFrequencyScan(float scanRangeMHz = 0.150f, float scanStepMHz = 0.010f);
static void startRecoveryScan(bool retryRead);

/**
 * @brief Reset the persisted frequency offset to zero and re-tune the radio.
 */
void resetFrequencyOffset();

/**
 * @brief Log the wiring / SPI link / radio diagnostic report to the serial monitor.
 *
 * Same block as the ESPHome "Diagnostic Report" button, so one format covers both
 * integrations. Safe to call when the radio never came up, which is when it is most
 * useful.
 */
void printDiagnosticReport();

// ============================================================================
// Frequency Management Implementation
// ============================================================================

/**
 * @brief Adaptive frequency tracking using FREQEST
 *
 * Accumulates frequency offset estimates from successful reads and gradually
 * adjusts radio frequency to track meter drift. Uses statistical averaging
 * (ADAPT_THRESHOLD reads) to avoid over-correction on noise.
 *
 * FREQEST register provides frequency error estimate in 2's complement format,
 * with resolution ~1.59 kHz per LSB (26 MHz crystal).
 *
 * Adjustment logic:
 * - Accumulate FREQEST over multiple reads
 * - After threshold reads, calculate average error
 * - If average > 2 kHz, apply 50% correction to avoid oscillation
 * - Save new offset to persistent storage
 * - Reinitialize CC1101 with corrected frequency
 *
 * @param freqest Frequency offset estimate from CC1101 FREQEST register (-128 to +127)
 */
void adaptiveFrequencyTracking(int8_t freqest);

// Secrets pulled from private.h file
// Note: MQTT Client ID is made unique per device by appending the meter serial number
// This prevents multiple devices from having the same client ID and causing MQTT connection conflicts

static const char *buildMqttClientIdWithSerial()
{
  static char client_id[64] = {};
  uint8_t year = 0;
  uint32_t serial = 0;
  if (everblu::core::parseMeterCode(METER_CODE, &year, &serial))
  {
    snprintf(client_id, sizeof(client_id), "%s-%lu", SECRET_MQTT_CLIENT_ID, (unsigned long)serial);
  }
  else
  {
    // Keep startup resilient so validation can print a clear error afterward.
    snprintf(client_id, sizeof(client_id), "%s-%s", SECRET_MQTT_CLIENT_ID, METER_CODE);
  }
  return client_id;
}

const char *MQTT_CLIENT_ID_WITH_SERIAL = buildMqttClientIdWithSerial();

EspMQTTClient mqtt(
    SECRET_WIFI_SSID,           // Your Wifi SSID
    SECRET_WIFI_PASSWORD,       // Your WiFi key
    SECRET_MQTT_SERVER,         // MQTT Broker server ip
    SECRET_MQTT_USERNAME,       // MQTT Username Can be omitted if not needed
    SECRET_MQTT_PASSWORD,       // MQTT Password Can be omitted if not needed
    MQTT_CLIENT_ID_WITH_SERIAL, // MQTT Client name: uniquely identifies device by appending meter serial
    1883                        // MQTT Broker server port
);

// Base MQTT topic prefix for all EverBlu Cyble entities
// Centralising this avoids repeating "everblu/cyble/" all over the code.
// mqttBaseTopic is populated during setup() after parsing METER_CODE.

const char jsonTemplate[] = "{ "
                            "\"liters\": %d, "
                            "\"counter\" : %d, "
                            "\"battery\" : %d, "
                            "\"rssi\" : %d, "
                            "\"timestamp\" : \"%s\" }";

// Define the default maximum retries if missing from the private.h file
#ifndef MAX_RETRIES
#define MAX_RETRIES 5 // Default: 5 retry attempts before cooldown
#endif

int _retry = 0;
const int max_retries = MAX_RETRIES;          // Maximum number of retry attempts (configurable in private.h)
unsigned long lastFailedAttempt = 0;          // Timestamp of last failed attempt
// The flag, rather than a non-zero lastFailedAttempt, is what marks the cooldown
// as running: millis() legitimately returns 0 for the first millisecond after
// boot, and a failure landing there must not skip the cooldown entirely. This
// mirrors MeterReader::m_inCooldown so both deployment paths behave the same.
bool g_inCooldown = false;
const unsigned long RETRY_COOLDOWN = 3600000; // 1 hour cooldown in milliseconds
bool g_autoScanAfterFailureDone = false;      // Guards the failure-recovery frequency scan to once per failure streak
bool g_postScanReadAttempted = false;         // Guards the single post-scan re-read to once per failure streak
bool g_scanActive = false;
bool g_scanRetryRead = false;
float g_scanPreviousOffset = 0.0f;
ReadFailure g_retryFailureReason = ReadFailure::None; // Most informative failure seen so far in the current retry sequence

