genestealer/everblu-meters-esp8266-improved/src/main.cpp
    // Human-readable table to the serial console
    MeterHistory::printToSerial(meter_data.history, currentVolume, "[HISTORY]");

    // Build and publish the JSON attributes payload
    char historyJson[1024];
    int written = MeterHistory::generateHistoryJson(meter_data.history, currentVolume,
                                                    historyJson, sizeof(historyJson));
    if (written > 0)
    {
      TS_PRINTF("[MQTT] Publishing JSON attributes (%d bytes): %s\n\n", written, historyJson);
      publishSub("liters_attributes", historyJson, true);
      delay(5);

      HistoryStats stats = MeterHistory::calculateStats(meter_data.history, currentVolume);
      TS_PRINTF("[MQTT] Published %d months historical data (current month usage: %u L)\n",
                stats.monthCount, stats.currentMonthUsage);
    }
    else
    {
      TS_PRINTLN("[WARN] No historical data JSON generated - skipping history publish for this frame");
    }
  }

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.reads_counter);
  publishSub("counter", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.battery_left);
  publishSub("battery", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.rssi_dbm);
  publishSub("rssi_dbm", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  publishSub("rssi_percentage", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.lqi);
  publishSub("lqi", valueBuffer, true);
  delay(5);
  publishSub("time_start", timeStartFormatted, true);
  delay(5);
  publishSub("time_end", timeEndFormatted, true);
  delay(5);
  publishSub("timestamp", iso8601, true); // ISO-8601 timestamp in UTC
  delay(5);
  publishSub("meter_time", meter_data.meter_time, true); // meter's own real-time clock
  delay(5);
  publishSub("meter_type", meter_data.meter_type, true); // meter type/identifier string
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateLQIToPercentage(meter_data.lqi));
  publishSub("lqi_percentage", valueBuffer, true);
  delay(5);

  // Publish all data as a JSON message as well this is redundant but may be useful for some
  char json[512];
  snprintf(json, sizeof(json), jsonTemplate, meter_data.volume, meter_data.reads_counter, meter_data.battery_left, meter_data.rssi, iso8601);
  publishSub("json", json, true);
  delay(5);

#if AUTO_ALIGN_READING_TIME
  // Optionally auto-align the daily scheduled reading time to the meter's wake window
  // Only apply when this read was triggered by the scheduler, not by manual MQTT command
  if (g_isScheduledRead)
  {
    int timeStart = constrain(meter_data.time_start, 0, 23);
    int timeEnd = constrain(meter_data.time_end, 0, 23);
    int window = (timeEnd - timeStart + 24) % 24; // hours in window (0 means unknown/all-day)

    if (window > 0)
    {
#if AUTO_ALIGN_USE_MIDPOINT
      int alignedHourLocal = (timeStart + (window / 2)) % 24; // midpoint (interpreted as local-offset time)
#else
      int alignedHourLocal = timeStart; // start of window (local-offset time)
#endif
      int alignedMinuteLocal = g_readMinuteLocal;
      updateResolvedScheduleFromLocal(alignedHourLocal, alignedMinuteLocal);

      // Publish updated reading_time HH:MM
      char readingTimeFormatted2[6];
      snprintf(readingTimeFormatted2, sizeof(readingTimeFormatted2), "%02d:%02d", g_readHourUtc, g_readMinuteUtc);
      publishSub("reading_time", readingTimeFormatted2, true);
      delay(5);

      TS_PRINTF("[SCHEDULE] Auto-aligned reading time to %02d:%02d local-offset (%02d:%02d UTC) (window %02d-%02d local)\n",
                    g_readHourLocal, g_readMinuteLocal, g_readHourUtc, g_readMinuteUtc, timeStart, timeEnd);
    }
  }
#endif

  // Notify MQTT that active reading has ended
  publishSub("active_reading", "false", true);
  publishSub("cc1101_state", cc1101RadioConnected ? "Idle" : "unavailable", true);
  digitalWrite(LED_BUILTIN, HIGH); // Turn off LED to indicate completion

  // Reset retry counter and cooldown on successful read
  _retry = 0;
  g_inCooldown = false;
  lastFailedAttempt = 0;
  g_retryFailureReason = ReadFailure::None;
  g_autoScanAfterFailureDone = false; // Allow a fresh auto-scan on the next failure streak
  g_postScanReadAttempted = false;    // Allow a fresh post-scan re-read on the next failure streak
  successfulReads++;
  lastErrorMessage = "None";

  // Publish success metrics (using char buffers instead of String)
  char metricBuffer[16];

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  publishSub("successful_reads", metricBuffer, true);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  publishSub("total_attempts", metricBuffer, true);

  publishSub("last_error", "None", true);

  // Perform adaptive frequency tracking based on FREQEST register
  adaptiveFrequencyTracking(meter_data.freqest);

  // Reset scheduled read flag for next invocation
  g_isScheduledRead = false;

  EVB_PRINTLN("========================================");
  EVB_PRINTLN("        METER READ - COMPLETE");
  EVB_PRINTLN("========================================");
  Serial.println("");
}

// Function: onScheduled
// Description: Schedules daily meter readings at the configured local-offset time.
void onScheduled()
{
  time_t tnow = time(nullptr);
  // Compute local-offset time by adding offset minutes to UTC epoch
  time_t tlocal = tnow + (time_t)TIMEZONE_OFFSET_MINUTES * 60;
  struct tm *ptm = gmtime(&tlocal);

  // Check if today is a valid reading day
  const bool timeMatch = (ptm->tm_hour == g_readHourLocal && ptm->tm_min == g_readMinuteLocal);

  // Fire once anywhere inside the scheduled minute, guarded to one read per day
  // by tm_yday. Keying the trigger on tm_sec == 0 (as before) meant a blocking
  // read, frequency scan or reconnect that spanned the exact :00 second made the
  // 500 ms poll miss the one-second window and skip the whole day's read, with
  // nothing logged. Servicing the entire scheduled minute widens the window 60x.
  // (A loop stall longer than the full scheduled minute can still miss it.)
  if (ScheduleManager::isReadingDay(ptm) && timeMatch && ptm->tm_yday != g_lastScheduledReadYday)
  {
    // Check if we're still in cooldown period after failed attempts.
    // Defer without latching the day so the read can still fire later once the
    // cooldown clears (while the scheduled minute is still current).
    if (g_inCooldown && (millis() - lastFailedAttempt) < RETRY_COOLDOWN)
    {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      TS_PRINTF("[WARN] Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);

      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, cooldownMsg, true);
      mqtt.executeDelayed(500, onScheduled);
      return;
    }

    // Cooldown period is over, reset and proceed
    g_inCooldown = false;
    lastFailedAttempt = 0;

    // Mark today serviced so this occurrence reads exactly once, even if another
    // poll (or a second poll chain) observes the same minute.
    g_lastScheduledReadYday = ptm->tm_yday;

    // Call back in 23 hours
    mqtt.executeDelayed(1000 * 60 * 60 * 23, onScheduled);

    EVB_PRINTLN("It is time to update data from meter :)");

