genestealer/everblu-meters-esp8266-improved/src/main.cpp
  TS_PRINTLN("[MQTT] Wi-Fi details published");
}

// Function: publishMeterSettings
// Description: Publishes meter configuration (year, serial, frequency) to MQTT.
void publishMeterSettings()
{
  TS_PRINTLN("[MQTT] Publish meter settings...");

  // Publish Meter Year, Serial (using char buffers instead of String)
  char valueBuffer[16];
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", g_meterYear);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/everblu_meter_year", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%lu", (unsigned long)g_meterSerial);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/everblu_meter_serial", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  // Publish Reading Schedule
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/reading_schedule", mqttBaseTopic);
  mqtt.publish(topicBuffer, readingSchedule, true);
  delay(5);

  // Publish Reading Time (UTC) as HH:MM text (resolved time that may be auto-aligned)
  char readingTimeFormatted[6];
  snprintf(readingTimeFormatted, sizeof(readingTimeFormatted), "%02d:%02d", (int)g_readHourUtc, (int)g_readMinuteUtc);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/reading_time", mqttBaseTopic);
  mqtt.publish(topicBuffer, readingTimeFormatted, true);
  delay(5);

  TS_PRINTLN("[MQTT] Meter settings published");
}

// Function: publishDiscoveryMessage
// Description: Helper function to publish a single MQTT discovery message for Home Assistant
// @param domain The Home Assistant domain (sensor, button, binary_sensor, etc.)
// @param entity The entity name suffix (e.g., "everblu_meter_value")
// @param jsonPayload The complete JSON discovery payload
static void publishDiscoveryMessage(const char *domain, const char *entity, const String &jsonPayload)
{
  // Buffer sizes increased for safety margin to prevent overflow
  // Worst case: "homeassistant/" (14) + "binary_sensor/" (14) +
  // optional METER_SERIAL (10) + "_" (1) + entity (50) + "/config" (7) + null (1) = ~97 bytes
  char configTopic[256];
  char entityId[128];
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
  snprintf(entityId, sizeof(entityId), "%lu_%s", (unsigned long)g_meterSerial, entity);
#else
  snprintf(entityId, sizeof(entityId), "%s", entity);
#endif
  snprintf(configTopic, sizeof(configTopic), "homeassistant/%s/%s/config", domain, entityId);
  mqtt.publish(configTopic, jsonPayload.c_str(), true);
  delay(5);
}

// Function: publishHADiscovery
// Description: Publishes all Home Assistant MQTT discovery messages with serial-specific entity IDs
void publishHADiscovery()
{
  TS_PRINTLN("[MQTT] Publishing Home Assistant discovery messages...");

  String json;

  // Reading (Total) - Main water/gas sensor
  TS_PRINTLN("[MQTT] Publishing Reading (Total) sensor discovery...");
  json = "{\n";
  json += "  \"name\": \"Reading (Total)\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_value\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_value\",\n";
  json += "  \"ic\": \"" + String(meterIcon) + "\",\n";
  json += "  \"unit_of_meas\": \"" + String(meterUnit) + "\",\n";
  json += "  \"dev_cla\": \"" + String(meterDeviceClass) + "\",\n";
  json += "  \"stat_cla\": \"total_increasing\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/liters\",\n";
  TS_PRINTF("[MQTT] Water Usage state topic: %s/liters\n", mqttBaseTopic);
  json += "  \"json_attr_t\": \"" + String(mqttBaseTopic) + "/liters_attributes\",\n";
  json += "  \"sug_dsp_prc\": 0,\n";
  json += "  \"frc_upd\": true,\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("sensor", "everblu_meter_value", json);

  // Read Counter
  json = "{\n";
  json += "  \"name\": \"Read Counter\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_counter\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_counter\",\n";
  json += "  \"ic\": \"mdi:counter\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/counter\",\n";
  json += "  \"frc_upd\": true,\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("sensor", "everblu_meter_counter", json);

  // Last Read (timestamp)
  json = "{\n";
  json += "  \"name\": \"Last Read\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_timestamp\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_timestamp\",\n";
  json += "  \"ic\": \"mdi:clock\",\n";
  json += "  \"dev_cla\": \"timestamp\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/timestamp\",\n";
  json += "  \"frc_upd\": true,\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("sensor", "everblu_meter_timestamp", json);

  // Request Reading Button
  json = "{\n";
  json += "  \"name\": \"Request Reading Now\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_request\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_request\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/trigger_force\",\n";
  json += "  \"pl_avail\": \"online\",\n";
  json += "  \"pl_not_avail\": \"offline\",\n";
  json += "  \"pl_prs\": \"update\",\n";
  json += "  \"frc_upd\": true,\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_request", json);

  // Diagnostic sensors
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_ip", buildDiscoveryJson("IP Address", "wifi_ip", "mdi:ip-network-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_rssi", buildDiscoveryJson("WiFi RSSI", "wifi_rssi", "mdi:signal-variant", "dBm", "signal_strength", "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_mac_address", buildDiscoveryJson("MAC Address", "mac_address", "mdi:network", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_ssid", buildDiscoveryJson("WiFi SSID", "wifi_ssid", "mdi:help-network-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_bssid", buildDiscoveryJson("WiFi BSSID", "wifi_bssid", "mdi:access-point-network", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_uptime", buildDiscoveryJson("Device Uptime", "uptime", nullptr, nullptr, "timestamp", nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_wifi_signal_percentage", buildDiscoveryJson("WiFi Signal", "wifi_signal_percentage", "mdi:wifi", "%", nullptr, "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_reading_time", buildDiscoveryJson("Reading Time (UTC)", "reading_time", "mdi:clock-outline", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_reading_schedule", buildDiscoveryJson("Reading Schedule", "reading_schedule", "mdi:calendar-clock", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_year", buildDiscoveryJson("Meter Year", "everblu_meter_year", "mdi:calendar", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_serial", buildDiscoveryJson("Meter Serial", "everblu_meter_serial", "mdi:barcode", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_battery_months", buildDiscoveryJson("Months Remaining", "battery", "mdi:battery-clock", "months", nullptr, "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_rssi_dbm", buildDiscoveryJson("RSSI", "rssi_dbm", "mdi:signal", "dBm", "signal_strength", "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_rssi_percentage", buildDiscoveryJson("Signal", "rssi_percentage", "mdi:signal-cellular-3", "%", nullptr, "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_lqi_percentage", buildDiscoveryJson("Signal Quality (LQI)", "lqi_percentage", "mdi:signal-cellular-outline", "%", nullptr, "measurement", nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_time_start", buildDiscoveryJson("Wake Time", "time_start", "mdi:clock-start", nullptr, nullptr, nullptr, nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_time_end", buildDiscoveryJson("Sleep Time", "time_end", "mdi:clock-end", nullptr, nullptr, nullptr, nullptr));
  publishDiscoveryMessage("sensor", "everblu_meter_meter_time", buildDiscoveryJson("Meter Clock", "meter_time", "mdi:clock-digital", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_meter_type", buildDiscoveryJson("Meter Type", "meter_type", "mdi:barcode", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_total_attempts", buildDiscoveryJson("Total Read Attempts", "total_attempts", "mdi:counter", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_successful_reads", buildDiscoveryJson("Successful Reads", "successful_reads", "mdi:check-circle", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_failed_reads", buildDiscoveryJson("Failed Reads", "failed_reads", "mdi:alert-circle", nullptr, nullptr, "total_increasing", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_last_error", buildDiscoveryJson("Last Error", "last_error", "mdi:alert", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_cc1101_state", buildDiscoveryJson("CC1101 State", "cc1101_state", "mdi:radio-tower", nullptr, nullptr, nullptr, "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_freq_offset", buildDiscoveryJson("Frequency Offset", "frequency_offset", "mdi:sine-wave", "kHz", nullptr, "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_tuned_frequency", buildDiscoveryJson("Tuned Frequency (MHz)", "tuned_frequency", "mdi:radio-tower", "MHz", nullptr, "measurement", "diagnostic"));
  publishDiscoveryMessage("sensor", "everblu_meter_freq_estimate", buildDiscoveryJson("Frequency Estimate", "frequency_estimate", "mdi:sine-wave", "kHz", nullptr, "measurement", "diagnostic"));

  // Buttons
  json = "{\n";
  json += "  \"name\": \"Restart Device\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_restart\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_restart\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/restart\",\n";
  json += "  \"pl_prs\": \"restart\",\n";
  json += "  \"ent_cat\": \"config\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_restart", json);

  json = "{\n";
  json += "  \"name\": \"Deep Frequency Scan\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_deep_scan\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_deep_scan\",\n";
  json += "  \"ic\": \"mdi:radar\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/deep_scan\",\n";
  json += "  \"pl_prs\": \"scan\",\n";
  json += "  \"ent_cat\": \"config\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_deep_scan", json);

  const char *scanCommands[] = {"scan", "stop_scan"};
  const char *scanNames[] = {"Frequency Scan", "Stop Frequency Scan"};
  const char *scanIcons[] = {"mdi:magnify", "mdi:stop-circle-outline"};
  for (size_t index = 0; index < 2; index++)
  {
    String object = String("everblu_meter_") + scanCommands[index];
    json = "{\"name\":\"" + String(scanNames[index]) + "\",\"uniq_id\":\"" + getMeterPrefix() + object;
    json += "\",\"ic\":\"" + String(scanIcons[index]) + "\",\"cmd_t\":\"" + String(mqttBaseTopic) + "/" + scanCommands[index];
    json += "\",\"pl_prs\":\"" + String(index == 0 ? "scan" : "stop") + "\",\"ent_cat\":\"config\",\"dev\":{" + buildDeviceJson() + "}}";
    publishDiscoveryMessage("button", object.c_str(), json);
  }

  json = "{\n";
  json += "  \"name\": \"Reset Frequency Offset\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_reset_frequency\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_reset_frequency\",\n";
  json += "  \"ic\": \"mdi:restore\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/reset_frequency\",\n";
  json += "  \"pl_prs\": \"reset\",\n";
  json += "  \"ent_cat\": \"config\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_reset_frequency", json);

  json = "{\n";
  json += "  \"name\": \"Diagnostic Report\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report\",\n";
  json += "  \"ic\": \"mdi:clipboard-text-search-outline\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"cmd_t\": \"" + String(mqttBaseTopic) + "/diagnostic_report\",\n";
  json += "  \"pl_prs\": \"report\",\n";
  json += "  \"ent_cat\": \"diagnostic\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("button", "everblu_meter_diagnostic_report", json);

  // The report text is far longer than the 255-character limit on a Home Assistant state,
  // so the state is the time it was taken and the text is exposed as a JSON attribute.
  json = "{\n";
  json += "  \"name\": \"Diagnostic Report\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report_state\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_diagnostic_report_state\",\n";
  json += "  \"ic\": \"mdi:clipboard-text-search-outline\",\n";
  json += "  \"dev_cla\": \"timestamp\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/diagnostic_report_state\",\n";
  json += "  \"val_tpl\": \"{{ value_json.taken }}\",\n";
  json += "  \"json_attr_t\": \"" + String(mqttBaseTopic) + "/diagnostic_report_state\",\n";
  json += "  \"ent_cat\": \"diagnostic\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("sensor", "everblu_meter_diagnostic_report_state", json);

  // Binary sensor for active reading
  json = "{\n";
  json += "  \"name\": \"Active Reading\",\n";
  json += "  \"uniq_id\": \"" + getMeterPrefix() + "everblu_meter_active_reading\",\n";
  json += "  \"obj_id\": \"" + getMeterPrefix() + "everblu_meter_active_reading\",\n";
  json += "  \"dev_cla\": \"running\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/active_reading\",\n";
  json += "  \"pl_on\": \"true\",\n";
  json += "  \"pl_off\": \"false\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  publishDiscoveryMessage("binary_sensor", "everblu_meter_active_reading", json);

