genestealer/everblu-meters-esp8266-improved/src/main.cpp
  char diagnosticReportTopic[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(diagnosticReportTopic, sizeof(diagnosticReportTopic), "%s/diagnostic_report", mqttBaseTopic);
  mqtt.subscribe(diagnosticReportTopic, [](const String &message)
                 {
    // Input validation: only accept "report" command
    if (message != "report") {
      TS_PRINTF("[WARN] Invalid diagnostic report command '%s' (expected 'report')\n", message.c_str());
      return;
    }

    EVB_PRINTLN("Diagnostic report command received via MQTT");
    printDiagnosticReport(); });

  // Publish Home Assistant discovery only when enabled in compile-time config.
#if ENABLE_HA_DISCOVERY
  TS_PRINTLN("[MQTT] Send Home Assistant discovery config.");
  publishHADiscovery();
#else
  TS_PRINTLN("[MQTT] Home Assistant discovery disabled by ENABLE_HA_DISCOVERY=0");
#endif

  // Set initial state for active reading
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/active_reading", mqttBaseTopic);
  mqtt.publish(topicBuffer, "false", true);
  delay(5);

  // Publish CC1101 radio availability status for button enable/disable
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_availability", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "online" : "offline", true);
  delay(5);

  // Publish initial diagnostic metrics (using char buffers instead of String)
  char metricBuffer[16];

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, cc1101RadioConnected ? "Idle" : "unavailable", true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/total_attempts", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/successful_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", failedReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/failed_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/last_error", mqttBaseTopic);
  mqtt.publish(topicBuffer, lastErrorMessage, true);
  delay(5);

  char freqBuffer[16];
  snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", FrequencyManager::getOffset() * 1000.0); // Convert MHz to kHz
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, true);
  delay(5);

  snprintf(freqBuffer, sizeof(freqBuffer), "%.6f", FrequencyManager::getTunedFrequency());
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/tuned_frequency", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, true);
  delay(5);

  TS_PRINTLN("[MQTT] MQTT config sent");

  // Publish initial Wi-Fi details
  publishWifiDetails();

  // Publish once the meter settings as set in the softeware
  publishMeterSettings();

  // Turn off LED to show everything is setup
  digitalWrite(LED_BUILTIN, HIGH); // turned off

  TS_PRINTLN("[STATUS] Setup done");
  EVB_PRINTLN("================================\n");

#if DISABLE_SCHEDULED_READINGS
  TS_PRINTLN("[SCHEDULE] Scheduled readings disabled (DISABLE_SCHEDULED_READINGS); manual reads only.");
#else
  onScheduled();
#endif
}

// ============================================================================
// Frequency Management (MQTT glue over the shared FrequencyManager)
// ============================================================================
//
// The scan / adaptive-tracking / persistence LOGIC lives in the shared
// FrequencyManager (src/services/frequency_manager.cpp) - the SAME code the
// ESPHome build uses. The thin wrappers below only add the MQTT-specific side
// effects (status + offset topics) that FrequencyManager intentionally does not
// know about, so the algorithm stays single-sourced across both builds.

// Status callback handed to FrequencyManager during scans: mirrors scan
// progress to the Home Assistant cc1101_state / status_message topics.
static void mqttFrequencyStatus(const char *state, const char *message)
{
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  if (state && *state)
  {
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
    mqtt.publish(topicBuffer, state, true);
  }
  if (message && *message)
  {
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, message, true);
  }
}

// Publish the current frequency offset (kHz) to Home Assistant.
static void publishFrequencyOffsetToMqtt()
{
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  char freqBuffer[16];
  snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", FrequencyManager::getOffset() * 1000.0);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, true);
}

// Function: performDeepFrequencyScan
// Description: Thin MQTT wrapper over the shared Deep frequency scan. The scan
//              algorithm itself (window mapping, zoom, issue #104 quality guard)
//              lives in FrequencyManager and is shared with the ESPHome build.
//              This wrapper only adds the MQTT-specific side effects (progress
//              status + resulting offset topic).
void performDeepFrequencyScan(float scanRangeMHz, float scanStepMHz)
{
  if (FrequencyManager::isScanInProgress() || _retry > 0) return;
  g_scanRetryRead = false;
  FrequencyManager::beginDeepFrequencyScan(scanRangeMHz, scanStepMHz, mqttFrequencyStatus);
  g_scanActive = FrequencyManager::isScanInProgress();
}

static void startRecoveryScan(bool retryRead)
{
  if (FrequencyManager::isScanInProgress()) return;
  g_scanRetryRead = retryRead;
  g_scanPreviousOffset = FrequencyManager::getOffset();
  FrequencyManager::beginRecoveryScan(mqttFrequencyStatus);
  g_scanActive = FrequencyManager::isScanInProgress();
}

// Function: resetFrequencyOffset
// Description: Clears the persisted CC1101 frequency offset back to 0, re-tunes
//              the radio to the configured base frequency and mirrors the reset
//              values to MQTT. This is the MQTT-build equivalent of the ESPHome
//              "Reset Frequency Offset" button and shares FrequencyManager so the
//              storage/re-tune logic stays single-sourced across both targets.
void resetFrequencyOffset()
{
  if (FrequencyManager::isScanInProgress() || _retry > 0) return;
  TS_PRINTLN("[FREQ] Resetting frequency offset to 0");

  // Reset the stored offset to 0 and persist it.
  FrequencyManager::saveFrequencyOffset(0.0);

