genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Reset adaptive tracking so a stale correction history cannot immediately
  // re-apply an offset after the reset.
  FrequencyManager::resetAdaptiveTracking();

  // Re-initialize the radio at the base frequency.
  const float baseFrequency = FrequencyManager::getBaseFrequency();
  cc1101RadioConnected = cc1101_init(baseFrequency);
  if (cc1101RadioConnected)
  {
    TS_PRINTF("[FREQ] Radio reinitialized with base frequency: %.6f MHz\n", baseFrequency);
  }
  else
  {
    TS_PRINTF("[FREQ] Radio reinit failed at base frequency: %.6f MHz\n", baseFrequency);
  }

  // Mirror the reset values to Home Assistant.
  publishFrequencyOffsetToMqtt();
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  char freqBuffer[16];
  snprintf(freqBuffer, sizeof(freqBuffer), "%.6f", FrequencyManager::getTunedFrequency());
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/tuned_frequency", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, false);
}

// Function: printDiagnosticReport
// Description: Log the shared wiring/link/radio diagnostic block to the serial (and
//              WiFi serial) monitor, and mirror it to a retained MQTT topic so it can be
//              read from Home Assistant without a serial cable. The report body lives in
//              the core driver, so this only supplies the configuration the driver cannot
//              know about, and the output matches the ESPHome "Diagnostic Report" button.
void printDiagnosticReport()
{
  if (FrequencyManager::isScanInProgress()) return;
  cc1101_report_context_t ctx;
  ctx.meter_code = METER_CODE;
  ctx.meter_year = g_meterYear;
  ctx.meter_serial = g_meterSerial;
  ctx.is_gas = meterIsGas;
  ctx.configured_frequency_mhz = FrequencyManager::getBaseFrequency();
  ctx.rx_attenuation_db = RX_ATTENUATION_DB;
  // Pins are compile-time defines shared with the driver in this build, so let the driver
  // describe them rather than restating the same #ifdefs here.
  ctx.cs_pin_text = nullptr;
  ctx.gdo0_pin_text = nullptr;
  ctx.gdo2_pin_text = nullptr;
  ctx.meter_initialised = cc1101RadioConnected;

  const char *report = cc1101_print_diagnostic_report(&ctx);

  // A Home Assistant state string is capped at 255 characters, which the report comfortably
  // exceeds, so the state carries only when it was taken and the text rides along as a JSON
  // attribute. Retained, so the entity survives a Home Assistant restart and the report is
  // still there when someone comes to read it.
  //
  // Allocated for the duration of the call rather than kept as a static buffer: it is
  // needed once per button press, and 1.6 KB is a meaningful share of the ESP8266's RAM to
  // hold permanently. It is also too large to put on the task stack.
  char *payload = (char *)malloc(DIAGNOSTIC_REPORT_PAYLOAD_SIZE);
  if (payload == nullptr)
  {
    TS_PRINTLN("[WARN] Not enough memory to publish the diagnostic report; see the log above");
    return;
  }

  const time_t now = time(nullptr);
  char takenIso[32];
  strftime(takenIso, sizeof(takenIso), "%FT%TZ", gmtime(&now));

  size_t used = (size_t)snprintf(payload, DIAGNOSTIC_REPORT_PAYLOAD_SIZE, "{\"taken\":\"%s\",\"report\":\"", takenIso);
  for (const char *c = report; *c != '\0' && used + 8 < DIAGNOSTIC_REPORT_PAYLOAD_SIZE; c++)
  {
    switch (*c)
    {
    case '"':
      used += (size_t)snprintf(payload + used, DIAGNOSTIC_REPORT_PAYLOAD_SIZE - used, "\\\"");
      break;
    case '\\':
      used += (size_t)snprintf(payload + used, DIAGNOSTIC_REPORT_PAYLOAD_SIZE - used, "\\\\");
      break;
    case '\n':
      used += (size_t)snprintf(payload + used, DIAGNOSTIC_REPORT_PAYLOAD_SIZE - used, "\\n");
      break;
    default:
      // Anything else below 0x20 would be an invalid raw JSON string character. The report
      // contains none today, but a meter code comes from user configuration.
      if ((unsigned char)*c < 0x20)
      {
        used += (size_t)snprintf(payload + used, DIAGNOSTIC_REPORT_PAYLOAD_SIZE - used, "\\u%04X",
                                 (unsigned)(unsigned char)*c);
      }
      else
      {
        payload[used++] = *c;
        payload[used] = '\0';
      }
      break;
    }
  }
  snprintf(payload + used, DIAGNOSTIC_REPORT_PAYLOAD_SIZE - used, "\"}");

  publishSub("diagnostic_report_state", payload, true);
  free(payload);
}

// Function: adaptiveFrequencyTracking
// Description: Thin MQTT wrapper over the shared adaptive frequency tracking.
//              Delegates the FREQEST accumulation / correction / persistence and
//              radio re-tune to FrequencyManager (shared with the ESPHome build),
//              then mirrors the resulting offset to MQTT.
void adaptiveFrequencyTracking(int8_t freqest)
{
  // Publish frequency_offset only when the shared tracker actually changed the
  // stored offset, to avoid churning the retained MQTT topic on every read when
  // the frequency is already stable.
  const float offsetBefore = FrequencyManager::getOffset();
  FrequencyManager::adaptiveFrequencyTracking(freqest);
  if (FrequencyManager::getOffset() != offsetBefore)
  {
    publishFrequencyOffsetToMqtt();
  }

  // Always publish tuned_frequency and frequency_estimate after each read so
  // the corresponding HA sensors are not left blank/unknown.
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  char freqBuffer[16];

  snprintf(freqBuffer, sizeof(freqBuffer), "%.6f", FrequencyManager::getTunedFrequency());
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/tuned_frequency", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, false);

  constexpr float FREQEST_TO_KHZ = 1.587f;
  snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", static_cast<float>(freqest) * FREQEST_TO_KHZ);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_estimate", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, false);
}

/**
 * @brief Validate configuration parameters
 *
 * Performs startup validation of configuration parameters to fail fast
 * on invalid settings. Checks:
 * - METER_CODE (must parse to non-zero serial within 24-bit protocol limit)
 * - FREQUENCY (must be 300-500 MHz if defined)
 * - READING_HOUR/MINUTE (must be valid time)
 * - Reading schedule string format
 *
 * Logs validation results to serial console with ✓ or ERROR markers.
 *
 * @return true if all validations passed, false if any parameter is invalid
 */
bool validateConfiguration()
{
  bool valid = true;
  uint8_t parsed_year = 0;
  uint32_t parsed_serial = 0;

