genestealer/everblu-meters-esp8266-improved/src/main.cpp
  EVB_PRINTLN("\n=== Configuration Validation ===");

  // Validate METER_CODE parse results
  if (!everblu::core::parseMeterCode(METER_CODE, &parsed_year, &parsed_serial))
  {
    TS_PRINTLN("[ERROR] Invalid METER_CODE in private.h");
    EVB_PRINTLN("       Expected dashed format: \"YY-SSSSSSS\" or \"YY-SSSSSSS-NNN\"");
    EVB_PRINTLN("       Example: label '16-0039185-107' -> '16-0039185-107'");
    valid = false;
  }
  else
  {
    g_meterYear = parsed_year;
    g_meterSerial = parsed_serial;
    EVB_PRINTF("✓ METER_CODE: %s (year=%d, serial=%lu)\n",
               METER_CODE, g_meterYear, (unsigned long)g_meterSerial);
  }

// Validate FREQUENCY if defined (should be 300-500 MHz for 433 MHz band)
#ifdef FREQUENCY
  if (FREQUENCY < 300.0 || FREQUENCY > 500.0)
  {
    TS_PRINTF("[ERROR] Invalid FREQUENCY=%.2f MHz (expected 300-500 MHz)\n", FREQUENCY);
    valid = false;
  }
  else
  {
    EVB_PRINTF("✓ FREQUENCY: %.6f MHz\n", FREQUENCY);
  }
#else
  EVB_PRINTLN("✓ FREQUENCY: Using default 433.82 MHz (RADIAN protocol)");
#endif

  // Validate reading time defaults (UTC)
  if (DEFAULT_READING_HOUR_UTC < 0 || DEFAULT_READING_HOUR_UTC > 23)
  {
    TS_PRINTF("[ERROR] Invalid DEFAULT_READING_HOUR_UTC=%d (expected 0-23)\n", DEFAULT_READING_HOUR_UTC);
    valid = false;
  }
  else if (DEFAULT_READING_MINUTE_UTC < 0 || DEFAULT_READING_MINUTE_UTC > 59)
  {
    TS_PRINTF("[ERROR] Invalid DEFAULT_READING_MINUTE_UTC=%d (expected 0-59)\n", DEFAULT_READING_MINUTE_UTC);
    valid = false;
  }
  else
  {
    EVB_PRINTF("✓ Reading Time (UTC): %02d:%02d\n", DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);
  }

// Validate GDO0 pin (basic check - should be defined)
#ifdef GDO0
  EVB_PRINTF("✓ GDO0 Pin: GPIO %d\n", GDO0);
#else
  TS_PRINTLN("[ERROR] GDO0 pin not defined in private.h");
  valid = false;
#endif

#if defined(GDO2)
  EVB_PRINTF("✓ GDO2 Pin: GPIO %d (TX/RX FIFO threshold - hardware-assisted underflow prevention)\n", GDO2);
#else // DISABLE_GDO2_FIFO_MANAGEMENT
  // src/core/cc1101.cpp emits a compile-time #error when neither GDO2 nor
  // DISABLE_GDO2_FIFO_MANAGEMENT is defined, so reaching here means the opt-out is set.
  EVB_PRINTLN("  GDO2 Pin: disabled via DISABLE_GDO2_FIFO_MANAGEMENT (legacy SPI polling fallback)");
#endif

  // Validate reading schedule
  if (!isValidReadingSchedule(readingSchedule))
  {
    TS_PRINTF("[WARNING] Invalid reading schedule '%s'. Will fall back to 'Monday-Friday'.\n", readingSchedule);
    EVB_PRINTLN("         Expected: presets ('Monday-Friday', 'Monday-Saturday', 'Monday-Sunday') or a single day ('Monday'..'Sunday')");
  }
  else
  {
    EVB_PRINTF("✓ Reading Schedule: %s\n", readingSchedule);
  }

  EVB_PRINTLN("================================\n");

  return valid;
}

// Function: setup
// Description: Initializes the device, including serial communication, Wi-Fi, MQTT, and CC1101 radio with automatic calibration.
void setup()
{
  Serial.begin(115200);
  Serial.println("\n");
  // Give Serial a moment to initialize
  delay(100);

  // Parse METER_CODE into g_meterYear, g_meterSerial, and topic buffers
  // Must happen before any code uses these values
  parseMeterCode();

// On platforms with native USB Serial (e.g. some ESP32 cores) wait briefly for host to open the port
#if defined(ESP32)
  unsigned long __serial_wait_start = millis();
  while (!Serial && millis() - __serial_wait_start < 1000)
  {
    delay(10);
  }
#endif
  EVB_PRINTLN("Everblu Meters ESP8266/ESP32 Starting...");
  EVB_PRINTLN("Water/Gas usage data for Home Assistant");
  EVB_PRINTLN("https://github.com/genestealer/everblu-meters-esp8266-improved");
  TS_PRINTF("[STATUS] Firmware version: %s\n", EVERBLU_FW_VERSION);
  TS_PRINTF("[STATUS] Target meter: 20%02d-%07lu\n\n", g_meterYear, (unsigned long)g_meterSerial);

  // Initialize meter type configuration
  initMeterTypeConfig();

  // Validate configuration before proceeding
  if (!validateConfiguration())
  {
    EVB_PRINTLN("\n*** FATAL: Configuration validation failed! ***");
    EVB_PRINTLN("*** Fix the errors in private.h and reflash ***");
    EVB_PRINTLN("*** Device halted - will not continue ***\n");
    while (1)
    {
      digitalWrite(LED_BUILTIN, LOW); // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }

  // Initialize resolved schedule caches using UTC defaults and configured timezone offset
  updateResolvedScheduleFromUtc(DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);

  EVB_PRINTLN("✓ Configuration valid - proceeding with initialization\n");

  // Note: mqttBaseTopic and meterSerialStr are initialized at global scope
  // to ensure they're ready when EspMQTTClient constructor runs
  TS_PRINTF("[MQTT] Base topic: %s\n", mqttBaseTopic);
  TS_PRINTF("[MQTT] Meter serial string: %s\n", meterSerialStr);
  TS_PRINTF("[MQTT] mqttBaseTopic length: %d\n", strlen(mqttBaseTopic));

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW); // turned on to start with

  // Initialize persistent storage
#if defined(ESP8266)
  // Clear EEPROM if requested (set CLEAR_EEPROM_ON_BOOT=1 in private.h)
  // Use this when replacing ESP board, CC1101 module, or moving to a different meter.
  // The normal path leaves EEPROM init to FrequencyManager::begin() ->
  // StorageAbstraction::begin(); only the maintenance clear needs an explicit
  // EEPROM.begin() here (avoids initializing EEPROM twice on every boot).
#if CLEAR_EEPROM_ON_BOOT
  EEPROM.begin(EEPROM_SIZE);
  TS_PRINTLN("[STORAGE] CLEARING EEPROM (CLEAR_EEPROM_ON_BOOT = 1)...");
  for (int i = 0; i < EEPROM_SIZE; i++)
  {
    EEPROM.write(i, 0xFF);
  }
  EEPROM.commit();
  TS_PRINTLN("[STORAGE] EEPROM cleared. Remember to set CLEAR_EEPROM_ON_BOOT = 0 after testing!");
#endif
#endif

  // Initialize the shared FrequencyManager: register this build's radio + meter
  // callbacks, then load any persisted offset. This is the SAME implementation the
  // ESPHome build uses (src/services/frequency_manager.cpp), so the scan, adaptive
  // tracking and storage logic is single-sourced across both targets.
  FrequencyManager::setRadioInitCallback(cc1101_init);
  FrequencyManager::setMeterReadCallback(get_meter_data);
  FrequencyManager::setAutoScanEnabled(autoScanEnabled);
  FrequencyManager::setAdaptiveThreshold(ADAPT_THRESHOLD);
  FrequencyManager::begin(FREQUENCY);

