genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // If no valid frequency offset found and auto-scan is enabled, perform Deep scan.
  // FrequencyManager updates its own stored offset during the scan, so no reload.
  if (FrequencyManager::shouldPerformAutoScan())
  {
    TS_PRINTLN("[FREQ] No stored frequency offset found. Performing Deep frequency scan...");
    performDeepFrequencyScan();
  }
  else if (!autoScanEnabled)
  {
    TS_PRINTLN("[FREQ] AUTO_SCAN_ENABLED=0; skipping automatic frequency scan (offset remains 0.0 MHz).");
  }

  // Increase the max packet size to handle large MQTT payloads
  mqtt.setMaxPacketSize(2048); // Set to a size larger than your longest payload

  // Set the Last Will and Testament (LWT) with serial-specific topic
  // Note: mqttLwtTopic is initialized at global scope to ensure it's ready before MQTT client connects
  mqtt.enableLastWillMessage(mqttLwtTopic, "offline", true); // You can activate the retain flag by setting the third parameter to true

  // Make reconnection attempts faster and deterministic
  mqtt.setWifiReconnectionAttemptDelay(15000); // try every 15s
  mqtt.setMqttReconnectionAttemptDelay(15000); // try every 15s
  // In rare cases where the board wedges during connection attempts, allow drastic reset
  mqtt.enableDrasticResetOnConnectionFailures();

// Conditionally enable Wi-Fi PHY mode 11G (ESP8266 only).
#if defined(ESP8266)
#if ENABLE_WIFI_PHY_MODE_11G
  WiFi.setPhyMode(WIFI_PHY_MODE_11G);
  EVB_PRINTLN("Wi-Fi PHY mode set to 11G.");
#else
  TS_PRINTLN("[WIFI] Wi-Fi PHY mode 11G is disabled.");
#endif
#else
  TS_PRINTLN("[WIFI] Wi-Fi PHY mode setting not applicable on this platform.");
#endif

  // Validate and log the configured reading schedule
  TS_PRINTF("[SCHEDULE] Reading schedule (configured): %s\n", readingSchedule);
  validateReadingSchedule();
  TS_PRINTF("[SCHEDULE] Reading schedule (effective): %s\n", readingSchedule);

  // Wire the effective schedule into ScheduleManager. Without this, onScheduled()
  // calls ScheduleManager::isReadingDay(), which reads the static default
  // ("Monday-Friday") - so a configured DEFAULT_READING_SCHEDULE was honoured in
  // the logs and HA discovery but silently ignored when deciding the reading day.
  ScheduleManager::setSchedule(readingSchedule);

  // Log effective frequency and warn if default is used
  TS_PRINTF("[FREQ] Frequency (effective): %.6f MHz\n", (double)FREQUENCY);
#if FREQUENCY_DEFINED_DEFAULT
  TS_PRINTLN("[NOTE] FREQUENCY not set in private.h; using default 433.820000 MHz (RADIAN).");
#endif

  // Optional functionalities of EspMQTTClient
#if ENABLE_MQTT_DEBUGGING
  mqtt.enableDebuggingMessages(true); // Enable debugging messages sent to serial output
  EVB_PRINTLN(">> MQTT debugging enabled");
#endif

  // Set CC1101 radio frequency with automatic calibration
  TS_PRINTLN("[FREQ] Initializing CC1101 radio...");
  float effectiveFrequency = FrequencyManager::getTunedFrequency();
  if (FrequencyManager::getOffset() != 0.0)
  {
    TS_PRINTF("[FREQ] Applying stored frequency offset: %.6f MHz (effective: %.6f MHz)\n",
                  FrequencyManager::getOffset(), effectiveFrequency);
  }
  if (!cc1101_init(effectiveFrequency))
  {
    TS_PRINTLN("[WARNING] CC1101 radio initialization failed!");
    EVB_PRINTLN("Please check: 1) Wiring connections 2) 3.3V power supply 3) SPI pins");
    EVB_PRINTLN("Continuing with WiFi/MQTT only - radio functionality will not be available");
    EVB_PRINTLN("Device will remain accessible via WiFi/MQTT for diagnostics and configuration");
    cc1101RadioConnected = false;
  }
  else
  {
    TS_PRINTLN("[FREQ] CC1101 radio initialized successfully");
    cc1101RadioConnected = true;
    TS_PRINTF("[FREQ] Adaptive frequency threshold set to %d reads\n", ADAPT_THRESHOLD);
  }

  /*
  // Use this piece of code to test
  struct tmeter_data meter_data;
  meter_data = get_meter_data();
  Serial.printf("\nVolume : %d\nBattery (in months) : %d\nCounter : %d\nTime start : %d\nTime end : %d\n\n", meter_data.volume, meter_data.battery_left, meter_data.reads_counter, meter_data.time_start, meter_data.time_end);
  while (42);
  */

  // Initialize connectivity watchdog timers
  g_bootMillis = millis();
  g_wifiAttemptStartMs = g_bootMillis;
  g_mqttAttemptStartMs = 0; // will start once Wi-Fi is up
  g_wifiOfflineSince = 0;
  g_mqttOfflineSince = 0;
  g_lastConnLogMs = 0;
  g_lastLedBlinkMs = millis();

  TS_PRINTLN("[NET] Waiting for Wi-Fi/MQTT... timeouts enabled (Wi-Fi 30s, MQTT 30s). Will retry automatically.");
}

// ============================================================================
// Main Loop
// ============================================================================

/**
 * @brief Non-blocking NTP sync poll
 *
 * Counterpart to the NTP kick-off in onConnectionEstablished(). Called from
 * loop(); logs the sync result (and the current UTC / local time) exactly once,
 * either when the clock becomes valid or when NTP_SYNC_TIMEOUT_MS elapses
 * without a sync. Schedule caches are time-independent and are set on connect.
 */
void pollNtpSync()
{
  if (!g_awaitingNtpSync)
    return;

  const time_t tnow = time(nullptr);
  const bool synced = tnow >= NTP_MIN_VALID_EPOCH;
  const unsigned long elapsed = millis() - g_ntpSyncStartMs;

  if (!synced && elapsed < NTP_SYNC_TIMEOUT_MS)
    return; // still waiting for the clock to be set

  g_awaitingNtpSync = false;

  if (synced)
  {
    TS_PRINTF("[TIME] ✓ NTP sync successful after %lu ms\n", elapsed);
  }
  else
  {
    TS_PRINTF("[WARNING] NTP sync failed within %lu ms. Clock may be unset (epoch=%ld).\n",
                  elapsed, (long)tnow);
  }

  struct tm *ptm = gmtime(&tnow);
  TS_PRINTF("[TIME] current date (UTC) : %04d/%02d/%02d %02d:%02d:%02d - %ld\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);
  // Print simple offset and derived local time for debugging
  int offsetMin = TIMEZONE_OFFSET_MINUTES;
  time_t tlocal = tnow + (time_t)offsetMin * 60;
  struct tm *plocal = gmtime(&tlocal);
  TS_PRINTF("[TIME] Configured UTC offset: %+d minutes\n", offsetMin);
  TS_PRINTF("[TIME] Current date (UTC+offset): %04d/%02d/%02d %02d:%02d:%02d - %ld\n",
                plocal->tm_year + 1900, plocal->tm_mon + 1, plocal->tm_mday,
                plocal->tm_hour, plocal->tm_min, plocal->tm_sec, (long)tlocal);
}

/**
 * @brief Main loop function
 *
 * Handles MQTT communication, OTA updates, state machine execution,
 * and periodic WiFi diagnostics publishing.
 */
void loop()
{
  mqtt.loop();
  ArduinoOTA.handle();
#if WIFI_SERIAL_MONITOR_ENABLED
  wifiSerialLoop();
#endif

